Repository: olvid-io/olvid-ios
Catalog: Sources/App/ObvKeycloakManager/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

source: Authenticate
de: Authentifizieren
es: Autenticar
fr: S'authentifier
it: Autentica
ja: 認証
ko: 인증
pt_br: Autenticar
pt_pt: Autenticar
ru: Авторизоваться
uk: Авторизуватися
zh_hans: 身份验证

source: Authenticate as %@
de: Als %@ authentifizieren
es: Autentícate como %@
fr: S'authentifier en tant que %@
it: Autenticati come %@
ja: %@として認証します
ko: %@(으)로 인증
pt_br: Autenticar como %@
pt_pt: Autenticar como %@
ru: Авторизоваться как %@
uk: Авторизуватися як %@
zh_hans: 以 %@ 身份进行身份验证

source: Authentication Required
de: Authentifizierung erforderlich
es: Se requiere autenticación
fr: Authentification Requise
it: Autenticazione richiesta
ja: 認証が必要です
ko: 인증 필요
pt_br: Autenticação Necessária
pt_pt: Autenticação Obrigatória
ru: Требуется аутентификация
uk: Потрібна автентифікація
zh_hans: 需要身份验证

# AUTHENTICATION_REQUIRED_%@
source: Authentication Required for %@
de: Authentifizierung für %@ erforderlich
es: Se requiere autenticación para %@
fr: Authentification Requise pour %@
it: Autenticazione richiesta per %@
ja: %@ の認証が必要です
ko: %@에 대한 인증이 필요합니다.
pt_br: Autenticação necessária para %@
pt_pt: Autenticação necessária para %@
ru: Требуется аутентификация для %@
uk: Потрібна автентифікація для %@
zh_hans: 需要为 %@ 进行身份验证

# AUTHENTICATION_REQUIRED_TOKEN_EXPIRED_MESSAGE
source: Your Olvid identity is managed by your company's identity provider. You need to re-authenticate with this identity provider to continue.
de: Ihre Olvid-Identität wird von Ihrem Unternehmens-Identitätsanbieter verwaltet. Sie müssen sich erneut bei diesem Identitätsanbieter authentifizieren, um fortzufahren.
es: Tu identidad de Olvid está gestionada por el proveedor de identidad de tu empresa. Necesitas volver a autenticarte con este proveedor para continuar.
fr: Votre identité Olvid est gérée par le fournisseur d'identité de votre entreprise. Il faut vous réauthentifier auprès de ce fournisseur d'identité pour continuer.
it: La tua identità Olvid è gestita dal provider di identità della tua azienda. Devi riautenticarti con questo provider di identità per continuare.
ja: お客様のOlvidアカウントは、会社のIDプロバイダーによって管理されています。続行するには、このIDプロバイダーで再度認証する必要があります。
ko: 귀하의 Olvid 계정은 회사에서 제공하는 신원 공급자를 통해 관리됩니다. 계속하려면 해당 신원 공급자로 다시 인증해야 합니다.
pt_br: Sua identidade Olvid é gerenciada pelo provedor de identidade da sua empresa. Você precisa se autenticar novamente com este provedor de identidade para continuar.
pt_pt: A sua identidade Olvid é gerida pelo fornecedor de identidade da sua empresa. Tem de autenticar-se novamente neste fornecedor de identidade para continuar.
ru: Ваша личность в Olvid управляется поставщиком удостоверений вашей компании. Вам необходимо повторно аутентифицироваться с помощью этого поставщика, чтобы продолжить.
uk: Ваша особистість Olvid управляється постачальником ідентифікації вашої компанії. Вам потрібно повторно автентифікуватися з цим постачальником ідентифікації, щоб продовжити.
zh_hans: 您的 Olvid 身份由您的公司身份提供程序管理。您需要使用此身份提供程序重新进行身份验证才能继续。

# AUTHENTICATION_REQUIRED_USER_ID_CHANGED_MESSAGE
source: You Olvid ID is managed by your company's identity provider. It seems you authenticated as a different user than usual. This is not supported. Please contact your administrator or re-authenticate as the correct user.
de: Ihre Olvid ID wird von Ihrem Unternehmens-Identitätsanbieter verwaltet. Es scheint, dass Sie sich als ein anderer Benutzer als gewöhnlich authentifiziert haben. Dies wird nicht unterstützt. Wenden Sie sich bitte an Ihren Administrator oder authentifizieren Sie sich erneut als der richtige Benutzer.
es: Tu ID de Olvid es gestionado por el proveedor de identidad de tu empresa. Parece que has autenticado como un usuario diferente al habitual. Esto no está soportado. Por favor, contacta a tu administrador o vuelve a autenticarte como el usuario correcto.
fr: Votre ID Olvid est géré par le fournisseur d'identité de votre entreprise. Il semblerait que vous vous soyez authentifié avec un compte différent du compte habituel. Ceci n'est pas supporté. Contactez votre adminisrateur ou réauthentifiez-vous avec le compte habituel.
it: Il tuo Olvid ID è gestito dal provider di identità della tua azienda. Sembra che tu ti sia autenticato con un utente diverso dal solito. Questa operazione non è supportata. Contatta il tuo amministratore o riautenticati con l'utente corretto.
ja: お客様のOlvid IDは、会社のIDプロバイダーによって管理されています。普段とは異なるユーザーとして認証されたようです。この操作はサポートされていません。 管理者にお問い合わせいただくか、正しいユーザーとして再認証してください。
ko: 귀사의 ID 공급업체에서 Olvid ID를 관리합니다. 평소와 다른 사용자로 인증하신 것 같습니다. 이 기능은 지원되지 않습니다. 관리자에게 문의하거나 올바른 사용자로 다시 인증해 주십시오.
pt_br: Seu ID Olvid é gerenciado pelo provedor de identidade da sua empresa. Parece que você fez login como um usuário diferente do habitual. Isso não é suportado. Entre em contato com seu administrador ou faça login novamente com o usuário correto.
pt_pt: O seu ID Olvid é gerido pelo fornecedor de identidade da sua empresa. Parece que efetuou a autenticação como um utilizador diferente do habitual. Isto não é suportado. Contacte o seu administrador ou volte a autenticar-se como o utilizador correto.
ru: Ваш Olvid ID управляется поставщиком удостоверений вашей компании. Похоже, вы вошли в систему под другим пользователем, чем обычно. Это не поддерживается. Пожалуйста, обратитесь к вашему администратору или повторно аутентифицируйтесь под правильным пользователем.
uk: Ваш Olvid ID керується постачальником ідентифікації вашої компанії. Здається, ви авторизувалися як інший користувач, ніж зазвичай. Це не підтримується. Зверніться до адміністратора або повторно авторизуйтеся як правильний користувач.
zh_hans: 您的 Olvid ID 由您公司的身份提供程序管理。您似乎使用了与平时不同的用户身份进行身份验证。这不受支持。 请联系您的管理员或使用正确的用户身份重新进行身份验证。

# BUTTON_LABEL_UPDATE_KEY
source: Update key
de: Schlüssel aktualisieren
es: Actualizar clave
fr: Mettre la clé à jour
it: Aggiorna chiave
ja: キーを更新
ko: 키 업데이트
pt_br: Atualizar chave
pt_pt: Atualizar chave
ru: Обновить ключ
uk: Оновити ключ
zh_hans: 更新密钥

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
pt_br: Cancelar
pt_pt: Cancelar
ru: Отмена
uk: Скасувати
zh_hans: 取消

# DIALOG_MESSAGE_KEYCLOAK_IDENTITY_WAS_REVOKED
source: It seems that your account was removed from your company's identity provider. If you left your company, this is normal and you may continue using Olvid as a free user. If you believe this is an error, please contact your administrator to re-register this identity provider with Olvid.
de: Es scheint, dass Ihr Konto von der Identitätsverwaltung Ihres Unternehmens entfernt wurde. Wenn Sie Ihr Unternehmen verlassen haben, ist dies normal und Sie können Olvid weiterhin als kostenloser Nutzer verwenden. Wenn Sie der Meinung sind, dass dies ein Fehler ist, wenden Sie sich bitte an Ihren Administrator, um diesen Identitätsanbieter bei Olvid erneut zu registrieren.
es: Parece que su cuenta fue eliminada del proveedor de identidad de su empresa. Si dejó su empresa, esto es normal y puede seguir usando Olvid como usuario gratuito. Si cree que esto es un error, por favor contacte a su administrador para que vuelva a registrar este proveedor de identidad con Olvid.
fr: Il semble que votre compte a été supprimé du fournisseur d'identité de votre société. Si vous avez quitté votre entreprise, ceci est normal et vous pouvez continuer à utiliser Olvid en tant qu'utilisateur gratuit. Si vous pensez que c'est une erreur, veuillez contacter votre administrateur pour enregistrer à nouveau ce fournisseur d'identité dans Olvid.
it: Sembra che il tuo account sia stato rimosso dal provider di identità della tua azienda. Se hai lasciato l'azienda, è normale e puoi continuare a utilizzare Olvid come utente gratuito. Se ritieni che si tratti di un errore, contatta il tuo amministratore per ri-registrare questo provider di identità con Olvid.
ja: お客様のアカウントが、会社のIDプロバイダーから削除されたようです。もし会社を離れたのであれば、これは正常な状態であり、引き続きOlvidを無料ユーザーとしてご利用いただけます。 もしこれが誤りであると思われる場合は、管理者にお問い合わせいただき、OlvidにこのIDプロバイダーを再登録してください。
ko: 귀하의 계정이 회사 ID 공급업체에서 제거된 것으로 보입니다. 회사를 떠나신 경우 이는 정상적인 현상이며, Olvid를 무료 사용자로 계속 사용할 수 있습니다. 만약 이것이 오류라고 생각되시면, 회사 관리자에게 문의하여 Olvid에 ID 공급업체를 다시 등록해 주십시오.
pt_br: Parece que sua conta foi removida do provedor de identidade da sua empresa. Se você deixou sua empresa, isso é normal e você pode continuar usando o Olvid como um usuário gratuito. Se você acredita que isso é um erro, entre em contato com seu administrador para registrar novamente este provedor de identidade no Olvid.
pt_pt: Parece que a sua conta foi removida do provedor de identidade da sua empresa. Se deixou a sua empresa, isto é normal e pode continuar a usar o Olvid como utilizador gratuito. Se acredita que isto é um erro, contacte o seu administrador para que volte a registar este provedor de identidade no Olvid.
ru: Похоже, что ваша учетная запись была удалена из поставщика удостоверений вашей компании. Если вы покинули компанию, это нормально, и вы можете продолжать использовать Olvid как бесплатный пользователь. Если вы считаете, что это ошибка, обратитесь к своему администратору, чтобы повторно зарегистрировать этого поставщика удостоверений в Olvid.
uk: Схоже, ваш обліковий запис було видалено з провайдера ідентифікації вашої компанії. Якщо ви залишили компанію, це нормально і ви можете продовжувати використовувати Olvid як безкоштовний користувач. Якщо ви вважаєте, що це помилка, зверніться до свого адміністратора, щоб повторно зареєструвати цього провайдера ідентифікації з Olvid.
zh_hans: 您的账户似乎已从您公司的身份提供程序中删除。如果您已离开公司，这是正常现象，您可以继续将 Olvid 用作免费用户。 如果您认为这是一个错误，请联系您的管理员，以将此身份提供程序重新注册到 Olvid 中。

# DIALOG_MESSAGE_KEYCLOAK_SIGNATURE_KEY_CHANGED
source: Olvid detected a change in the cryptographic signature key of your identity provider. This should normally never happen. Please contact your administrator and only press "Update Key" if she can confirm the key change was intentional. If unsure, press "Cancel".
de: Olvid hat eine Änderung des kryptografischen Signaturschlüssels Ihres Identitätsanbieters festgestellt. Dies sollte normalerweise nicht vorkommen. Bitte kontaktieren Sie Ihren Administrator und drücken Sie "Schlüssel aktualisieren", nur wenn dieser bestätigen kann, dass die Schlüsseländerung beabsichtigt war. Wenn Sie sich nicht sicher sind, drücken Sie "Abbrechen".
es: Olvid detectó un cambio en la clave de firma criptográfica de tu proveedor de identidad. Esto no debería ocurrir normalmente. Por favor, contacta a tu administrador y solo pulsa "Actualizar Clave" si puede confirmar que el cambio de clave fue intencional. Si no estás seguro, pulsa "Cancelar".
fr: Olvid a détecté une modification de la clé de signature cryptographique de votre fournisseur d'identité. Cela ne devrait normalement jamais arriver. Veuillez contacter votre administrateur et n'appuyer sur « Mettre la clé à jour » que s'il peut confirmer que cette modification est intentionnelle. En cas de doute, appuyez sur « Annuler ».
it: Olvid ha rilevato una modifica nella chiave di firma crittografica del tuo provider di identità. Questo non dovrebbe mai accadere normalmente. Contatta il tuo amministratore e premi "Aggiorna Chiave" solo se può confermare che la modifica della chiave è stata intenzionale. In caso di dubbi, premi "Annulla".
ja: Olvidは、お客様のIDプロバイダーの暗号署名キーの変更を検出しました。通常、これは起こるべきではありません。 管理者に連絡し、「キーを更新」ボタンを押す前に、キーの変更が意図的なものであることを確認してください。不明な場合は、「キャンセル」ボタンを押してください。
ko: Olvid는 ID 공급자의 암호화 서명 키 변경 사항을 감지했습니다. 이는 일반적으로 발생해서는 안 되는 일입니다. 관리자에게 문의하고 관리자가 키 변경이 의도적인 변경 사항인지 확인한 경우에만 "키 업데이트"를 누르십시오. 확실하지 않은 경우 "취소"를 누르십시오.
pt_br: O Olvid detectou uma alteração na chave de assinatura criptográfica do seu provedor de identidade. Isso não deveria acontecer normalmente. Entre em contato com o seu administrador e pressione "Atualizar Chave" somente se ele puder confirmar que a alteração da chave foi intencional. Se tiver dúvidas, pressione "Cancelar".
pt_pt: O Olvid detetou uma alteração na chave de assinatura criptográfica do seu fornecedor de identidade. Isto não deveria acontecer normalmente. Contacte o seu administrador e prima apenas em "Atualizar Chave" se ele confirmar que a alteração da chave foi intencional. Se tiver dúvidas, prima em "Cancelar".
ru: Olvid обнаружил изменение в криптографическом ключе подписи вашего провайдера идентификации. Это не должно происходить в нормальных условиях. Пожалуйста, свяжитесь с вашим администратором и нажимайте "Обновить ключ" только в том случае, если она подтвердит, что изменение ключа было преднамеренным. Если вы не уверены, нажмите "Отмена".
uk: Olvid виявив зміну в криптографічному ключі підпису вашого провайдера ідентифікації. Це не повинно відбуватися за нормальних обставин. Зверніться до вашого адміністратора і натисніть кнопку "Оновити ключ" лише якщо він підтвердить, що зміна ключа була навмисною. Якщо ви не впевнені, натисніть кнопку "Скасувати".
zh_hans: Olvid 检测到您的身份验证提供商的加密签名密钥发生了更改。这通常不应该发生。 请联系您的管理员，并且仅在管理员确认密钥更改是故意的时，才按下“更新密钥”。如果不确定，请按下“取消”。

# DIALOG_TITLE_KEYCLOAK_IDENTITY_WAS_REVOKED
source: Identity provider removed
de: Identitätsanbieter entfernt
es: Proveedor de identidad eliminado
fr: Fournisseur d'identité supprimé
it: Fornitore di identità rimosso
ja: IDプロバイダーを削除しました
ko: 계정 제공업체가 제거되었습니다
pt_br: Provedor de identidade removido
pt_pt: Fornecedor de identidade removido
ru: Поставщик удостоверений удален
uk: Постачальника ідентифікаційних даних видалено
zh_hans: 身份提供程序已移除

# DIALOG_TITLE_KEYCLOAK_SIGNATURE_KEY_CHANGED
source: Identity provider key change
de: Änderung des Identitätsanbieterschlüssels
es: Cambio de clave del proveedor de identidad
fr: Changement de clé du fournisseur d'identité
it: Modifica della chiave del provider di identità
ja: ID プロバイダーキーの変更
ko: ID 공급업체 키 변경
pt_br: Alteração da chave do provedor de identidade
pt_pt: Alteração da chave do fornecedor de identidade
ru: Изменение ключа поставщика идентификации
uk: Зміна ключа провайдера ідентифікації
zh_hans: 身份验证提供商密钥已更改

# KEYCLOAK_REVOCATION
source: Revoke previous Olvid ID
de: Vorherige Olvid ID widerrufen
es: Revocar ID de Olvid anterior
fr: Révoquer l'ID Olvid précédent
it: Revoca l'ID Olvid precedente
ja: 以前のOlvid IDを無効にする
ko: 이전 Olvid ID를 취소합니다
pt_br: Revogar o ID Olvid anterior
pt_pt: Revogar o ID Olvid anterior
ru: Отменить предыдущий Olvid ID
uk: Скасувати попередній Olvid ID
zh_hans: 撤销之前的 Olvid ID

# KEYCLOAK_REVOCATION_BUTTON
source: Revoke previous ID
de: Vorherige ID widerrufen
es: Revocar ID anterior
fr: Révoquer ID précédent
it: Revoca ID precedente
ja: 以前のIDを無効にする
ko: 이전 ID를 취소합니다
pt_br: Revogar ID anterior
pt_pt: Revogar ID anterior
ru: Отменить предыдущий ID
uk: Відкликати попередній ID
zh_hans: 撤销之前的 ID

# KEYCLOAK_REVOCATION_FORBIDDEN_MESSAGE
source: Please contact your administrator.
de: Bitte wenden Sie sich an Ihren Administrator.
es: Por favor, contacta a tu administrador.
fr: Nous vous recommandons de contacter votre administrateur.
it: Si prega di contattare il tuo amministratore.
ja: 管理者にお問い合わせください。
ko: 관리자에게 문의해 주세요.
pt_br: Entre em contato com o administrador.
pt_pt: Por favor, contacte o seu administrador.
ru: Пожалуйста, обратитесь к вашему администратору.
uk: Зверніться до адміністратора.
zh_hans: 请联系您的管理员。

# KEYCLOAK_REVOCATION_FORBIDDEN_TITLE
source: You cannot revoke your identity
de: Du kannst deine Identität nicht widerrufen.
es: No puedes revocar tu identidad
fr: Vous ne pouvez pas révoquer votre identité
it: Non puoi revocare la tua identità
ja: 自分の身元情報を取り消すことはできません
ko: 본인 정보를 취소할 수 없습니다.
pt_br: Você não pode revogar sua identidade
pt_pt: Não pode revogar a sua identidade
ru: Вы не можете отменить подтверждение своей личности
uk: Ви не можете відкликати свою особистість
zh_hans: 您无法撤销您的身份验证

# KEYCLOAK_REVOCATION_MESSAGE
source: Another Olvid ID is associated with your account on your company's identity provider. If you generated a new ID you need to revoke the previous one.
de: Eine andere Olvid-ID ist mit Ihrem Konto bei Ihrem Unternehmens-Identitätsanbieter verknüpft. Wenn Sie eine neue ID generiert haben, müssen Sie die vorherige widerrufen.
es: Se ha asociado otro ID de Olvid a tu cuenta en el proveedor de identidad de tu empresa. Si generaste un nuevo ID, debes revocar el anterior.
fr: Un autre ID Olvid est associé avec le compte géré par le fournisseur d'identité de votre entreprise. Si vous avez généré un nouvel ID Olvid, il vous faut révoquer le précédent.
it: Un altro ID Olvid è associato al tuo account sul provider di identità della tua azienda. Se hai generato un nuovo ID, devi revocare quello precedente.
ja: お客様の会社のIDプロバイダーで、お客様のアカウントに別のOlvid IDが関連付けられています。新しいIDを生成した場合は、以前のIDを無効にする必要があります。
ko: 귀하의 회사 ID 공급자에 귀하의 계정과 연결된 다른 Olvid ID가 있습니다. 새 ID를 생성한 경우 이전 ID를 해지해야 합니다.
pt_br: Outro ID Olvid está associado à sua conta no provedor de identidade da sua empresa. Se você gerou um novo ID, precisará revogar o anterior.
pt_pt: Está associado outro ID Olvid à sua conta no fornecedor de identidade da sua empresa. Se tiver gerado um novo ID, tem de revogar o anterior.
ru: К вашей учетной записи на сервере идентификации вашей компании привязан другой Olvid ID. Если вы сгенерировали новый ID, необходимо отозвать предыдущий.
uk: До вашого облікового запису на провайдері ідентифікації вашої компанії прив’язано інший Olvid ID. Якщо ви згенерували новий ID, вам потрібно відкликати попередній.
zh_hans: 您的公司身份验证服务中已关联了另一个 Olvid ID。如果您已生成新的 ID，则需要撤销之前的 ID。

source: User change detected
de: Benutzeränderung erkannt
es: Cambio de usuario detectado
fr: Changement d'utilisateur détecté
it: Modifica utente rilevata
ja: ユーザーの変更を検出しました
ko: 사용자 변경 사항 감지
pt_br: Alteração de usuário detectada
pt_pt: Alteração de utilizador detetada
ru: Обнаружено изменение пользователя
uk: Зміна користувача виявлено
zh_hans: 检测到用户更改

source: Ok
es: De acuerdo
ja: 了解
ko: 알겠습니다
ru: Ок
uk: Добре
zh_hans: 好的
